Revit 2027 API
RebarShapeDrivenAccessor.FlipRebarSet Method
 Flips the rebar set by changing the RebarPlane with the OutOfPlaneExtent and vice versa.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void FlipRebarSet()
Public Sub FlipRebarSet
public:
void FlipRebarSet()
member FlipRebarSet : unit -> unit
Exceptions
Exception | Condition
InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
InvalidOperationException |  This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
See Also
Reference
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace